tutorials/incompressible/pimpleRemeshFoam/simple_0012/steadyNACA/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0.0025000000000000005 0 0 0.0025000000000000005 0 0.0025000000000000005);

boundaryField
{
    freestream
    {
        type            freestream;
        freestreamValue uniform (0.0025000000000000005 0 0 0.0025000000000000005 0 0.0025000000000000005);
    }
    airfoil
    {
        type            kqRWallFunction;
        value           uniform (0.0025000000000000005 0 0 0.0025000000000000005 0 0.0025000000000000005);
    }
    BaseAndTop
    {
        type            empty;
    }
}