tutorials/incompressible/pimpleRemeshFoam/simple_0012/steadyNACA/0/kt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0037500000000000007;

boundaryField
{
    freestream
    {
        type            freestream;
        freestreamValue uniform 0.0037500000000000007;
    }
    airfoil
    {
        type            kqRWallFunction;
        value           uniform 0.0037500000000000007;
    }
    BaseAndTop
    {
        type            empty;
    }
}