tutorials/incompressible/pimpleRemeshFoam/simple_0012/steadyNACA/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 11.972732822363877;

boundaryField
{
    freestream
    {
        type            freestream;
        freestreamValue uniform 11.972732822363877;
    }
    airfoil
    {
        type            omegaWallFunction;
        value           uniform 11.972732822363877;
    }
    BaseAndTop
    {
        type            empty;
    }
}