tutorials/incompressible/pimpleRemeshFoam/simple_0012/steadyNACA/system/include/forceCoefficientTrigger
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      forceCoefficientConvergenceTrigger;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

runTimeControl1
{
    type            runTimeControl;
    libs            (utilityFunctionObjects);
    controlMode     trigger;
    triggerStart    1;
    conditions
    {
        condition1
        {
            type            average;
            functionObject  forceCoeffs;
            fields          (Cl);
            tolerance       0.0001;
            window          20;
            windowType      approximate;
        }
    }
}

runTimeControl2
{
    type            runTimeControl;
    libs            (utilityFunctionObjects);
    conditions
    {
        conditions1
        {
            type            maxDuration;
            duration        500;
        }
    }
    satisfiedAction setTrigger;
    trigger         1;
}
// ************************************************************************* //
